Revit 2027 API
SpatialElementBoundarySubface.Valid Property
 Indicates if the subface instance is valid and can be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Valid { get; }
Public ReadOnly Property Valid As Boolean
	Get
public:
property bool Valid {
	bool get ();
}
member Valid : bool with get
Property Value
Boolean
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace